[
  {
    "id": 5,
    "title": "Computer Scientist",
    "company": "Innovation, Science and Economic Development Canada (AI Accelerator Lab)",
    "companyLink": "https://ised-isde.canada.ca/site/ised/en",
    "date": "Jan – Aug 2025",
    "tools": ["Python", "React", "OpenAI", "Flask"],
    "description": [
      "Refactored intranet-facing AI chatbot frontend into a lightweight React application, reducing bundle size from 20MB to 500KB and reducing lines of code by 75%, which delivered faster load times and simplified feature development.",
      "Developed interventions module for a parliamentary committee transcription and summarization tool, leveraging LLMs to extract MPs’ key lines of questioning and reducing analyst overtime in preparing reports for the Privy Council Office.",
      "Optimized transcription pipeline by benchmarking libraries and resolving memory bottlenecks, reducing processing time for 2-hour meetings from 45 minutes to 10 minutes"
    ]
  },
  {
    "id": 4,
    "title": "Associate AI Engineer",
    "company": "Spellbook",
    "companyLink": "https://spellbook.legal",
    "date": "May – Aug 2024",
    "tools": ["scikit-learn", "NumPy", "Matplotlib", "OpenAI"],
    "description": [
      "Enhanced contract review efficiency by redesigning LLM-based scoring system; fine-tuned OpenAI models and tested classifiers to significantly improve accuracy.",
      "Delivered weekly analytics presentations translating insights from 1M+ user interactions into actionable recommendations."
    ]
  },
  {
    "id": 3,
    "title": "Software Developer",
    "company": "Spellbook",
    "companyLink": "https://spellbook.legal",
    "date": "Sept – Dec 2023",
    "tools": ["React", "TypeScript", "TailwindCSS", "Framer Motion", "Figma"],
    "description": [
      "Contributed to a complete UI overhaul within a two-month timeframe.",
      "Introduced Framer Motion for animations and microinteractions.",
      "Built complex primitives and atomic components with interactive Storybook tests."
    ]
  },
  {
    "id": 2,
    "title": "Full Stack Developer",
    "company": "Tamvoes Health",
    "companyLink": "https://tamvoes.com",
    "date": "Jan – April 2023",
    "tools": ["Pyramid", "Python", "jQuery", "React"],
    "description": [
      "Overhauled event and contact sharing platform by building decoupled, single-purpose API endpoints.",
      "Refactored legacy code from jQuery and Handlebars to React to improve maintainability."
    ]
  },
  {
    "id": 1,
    "title": "Full Stack Web Developer",
    "company": "Tradable Bits Media",
    "companyLink": "https://tradablebits.com",
    "date": "May – Aug 2022",
    "tools": ["Flask", "jQuery", "Python", "PostgreSQL", "Facebook Graph API"],
    "description": [
      "Deployed a sales funnel builder to track fan engagement flows, resulting in a 25% increase in conversions.",
      "Optimized user experience using the Facebook Graph API to repurpose ad templates as posts.",
      "Constructed efficient PostgreSQL queries adhering to ACID principles."
    ]
  }
]
